# Идея была, сначала, просто написать покороче. А потом, еще, и без if-ов.
def to_russian_string(value: int) -> str:
    assert -1 < value < 1000, "Wrong value"
    answer = []
    first_rank = {
        "0": ("", "", "", "десять"),
        "1": ("сто", "", "один", "одиннадцать"),
        "2": ("двести", "двадцать", "два", "двенадцать"),
        "3": ("триста", "тридцать", "три", "тринадцать"),
        "4": ("четыреста", "сорок", "четыре", "четырнадцать"),
        "5": ("пятьсот", "пятьдесят", "пять", "пятнадцать"),
        "6": ("шестьсот", "шестьдесят", "шесть", "шестнадцать"),
        "7": ("семьсот", "семьдесят", "семь", "семнадцать"),
        "8": ("восемьсот", "восемьдесят", "восемь", "восемнадцать"),
        "9": ("девятьсот", "девяносто", "девять", "девятнадцать")
    }
    flag = value % 100 // 10 == 1
    list_units = list(f"{value}".rjust(3, "0")[::1 + flag])
    dic_range = range(0, 3 + flag, 1 + flag * 2)
    for i, j in zip(list_units, dic_range):
        answer.append(first_rank[i][j])
    return (" ".join(filter(lambda x: x != "", answer)).lstrip() * bool(value)) + ("ноль" * (not bool(value)))
